In [3]:
import numpy as np
import pandas as pd

# 과제 3

과제 1

```python
다음의 데이터 df_all 를 활용해서 아래의 정보를 확인해보세요
dataFrame 내에 결측치 여부를 boolean 형태로 확인해보세요
row 행(0, 1), 열('A', 'B') 에 있는 값을 [['A1', 'A2'], [0.5, 2.2]] 로 대체해 보세요
컬럼별 결측값 개수를 구해보세요
행 단위로 결측값 개수를 구해보세요
```

In [70]:
df_left = pd.DataFrame({'KEY': ['K0', 'K1', 'K2', 'K3'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': [0.5, 2.2, 3.6, 0.4]})

df_right = pd.DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'],
                         'C': ['C2', 'C3', 'C4', 'C5'],
                         'D': ['D2', 'D3', 'D4', 'D5']})

df_all = pd.merge(df_left, df_right,  how='outer', on='KEY')

In [50]:
#결측치 확인하기
df_all.isna()

     KEY      A      B      C      D
0  False  False  False   True   True
1  False  False  False   True   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False   True   True  False  False

In [51]:
#값 대체하기

df_all

  KEY    A    B    C    D
0  K0   A0  0.5  NaN  NaN
1  K1   A1  2.2  NaN  NaN
2  K2   A2  3.6   C2   D2
3  K3   A3  0.4   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

In [77]:
df_all['A'][[0, 1]] = df_all['A'][[0, 1]].replace(['A0', 'A1'], ['A1', 'A2'])

/private/var/mobile/Containers/Data/Application/17E42106-9DBD-43A0-AE73-170C5EF63278/tmp/ipykernel_19579/4090166920.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_all['A'][[0, 1]] = df_all['A'][[0, 1]].replace(['A0', 'A1'], ['A1', 'A2'])

In [78]:
df_all

  KEY    A    B    C    D
0  K0   A1  0.5  NaN  NaN
1  K1   A2  2.2  NaN  NaN
2  K2   A2  3.6   C2   D2
3  K3   A3  0.4   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

In [79]:
#컬럼별 결측값 구하기
df_all.isna().sum()

KEY    0
A      2
B      2
C      2
D      2
dtype: int64

In [81]:
#행 단위로 결측값 구하기
df_all.isna().sum(1)

0    2
1    2
2    0
3    0
4    2
5    2
dtype: int64

## 과제 2
```
다음의 데이터 df 를 활용해서 아래의 정보를 확인해보세요
C1, C2 컬럼의 합을 계산해보세요
C1, C2 컬럼의 누적합을 계산해 보세요
C1, C2 컬럼의 평균값과 표준편차 값을 계산해 보세요
```

In [82]:
df = pd.DataFrame(np.arange(10).reshape(5, 2),
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['C1', 'C2'])

df.loc[['b', 'e'], ['C1']] = None
df.loc[['b', 'c'], ['C2']] = None

In [83]:
df

    C1   C2
a  0.0  1.0
b  NaN  NaN
c  4.0  NaN
d  6.0  7.0
e  NaN  9.0

In [85]:
#각 컬럼합 구하기
print("C1 컬럼의 합:",df['C1'].sum())
print("C2 컬럼의 합:",df['C2'].sum())

C1 컬럼의 합: 10.0
C2 컬럼의 합: 17.0

In [93]:
#두 컬럼의 합
df['C1']+df['C2']

a     1.0
b     NaN
c     NaN
d    13.0
e     NaN
dtype: float64

In [96]:
#각 컬럼 누적 합 구하기
print("C1 컬럼의 누적합: \n",df['C1'].cumsum())
print("C2 컬럼의 누적합: \n",df['C2'].cumsum())

C1 컬럼의 누적합:
 a     0.0
b     NaN
c     4.0
d    10.0
e     NaN
Name: C1, dtype: float64
C2 컬럼의 누적합:
 a     1.0
b     NaN
c     NaN
d     8.0
e    17.0
Name: C2, dtype: float64

In [92]:
#두 컬럼의 누적합
(df['C1']+df['C2']).cumsum()

a     1.0
b     NaN
c     NaN
d    14.0
e     NaN
dtype: float64

In [105]:
#컬럼의 표준편차
print("C1 컬럼의 평균: ", df['C1'].mean(), "표준편차:", df['C1'].std())
print("C2 컬럼의 평균: ", df['C2'].mean(), "표준편차:", df['C2'].std())

C1 컬럼의 평균:  3.3333333333333335 표준편차: 3.0550504633038935
C2 컬럼의 평균:  5.666666666666667 표준편차: 4.163331998932266

## 과제 3
```
다음의 데이터 df를 활용해서 아래 지시사항의 결과를 도출해 주세요
결측값을 모두 0으로 대체해 주세요
결측값을 앞 방향으로 채워 주세요
(ex) index 1번에 있는 값이 결측이라면, index 0번의 값으로 결측값 대체)
결측값을 뒷 방향으로 채워 주는데, 개수를 1개로 한정해서 채워 주세요.
(ex) index 0, 1번에 있는 값이 결측이라면, index 2번의 값으로 1번만 결측값 대체)
결측값을 컬럼(변수)별 평균으로 대체해 주세요
C2 컬럼에서 결측값이 없으면 C2 컬럼을 그대로 사용하며, C2 컬럼에 결측값이 있으면 C1 컬럼으로 결측값 대체
```

In [135]:
df = pd.DataFrame(np.random.randn(5, 3), columns=['C1', 'C2', 'C3'])
df.iloc[0, 0] = None
df.loc[1, ['C1', 'C3']] = np.nan
df.loc[2, 'C2'] = np.nan
df.loc[3, 'C2'] = np.nan
df.loc[4, 'C3'] = np.nan

In [110]:
df

         C1        C2        C3
0       NaN -1.095595  0.195181
1       NaN  1.111213       NaN
2 -0.338906       NaN -0.068846
3 -0.213076       NaN  1.080229
4 -1.100476 -0.539788       NaN

In [111]:
df.fillna(0)

         C1        C2        C3
0  0.000000 -1.095595  0.195181
1  0.000000  1.111213  0.000000
2 -0.338906  0.000000 -0.068846
3 -0.213076  0.000000  1.080229
4 -1.100476 -0.539788  0.000000

In [113]:
df.fillna(method='bfill', limit=1)

         C1        C2        C3
0       NaN -1.095595  0.195181
1 -0.338906  1.111213 -0.068846
2 -0.338906       NaN -0.068846
3 -0.213076 -0.539788  1.080229
4 -1.100476 -0.539788       NaN

In [114]:
df.fillna(df.mean()), df.where(pd.notnull(df), df.mean(), axis='columns')

(         C1        C2        C3
 0 -0.550820 -1.095595  0.195181
 1 -0.550820  1.111213  0.402188
 2 -0.338906 -0.174723 -0.068846
 3 -0.213076 -0.174723  1.080229
 4 -1.100476 -0.539788  0.402188,
          C1        C2        C3
 0 -0.550820 -1.095595  0.195181
 1 -0.550820  1.111213  0.402188
 2 -0.338906 -0.174723 -0.068846
 3 -0.213076 -0.174723  1.080229
 4 -1.100476 -0.539788  0.402188)

In [144]:
df2 = df.copy()

In [146]:
# 각 컬럼별 평균으로 대체하기
for i in df2.columns:
    df2[i] = df2[i].fillna(df2[i].mean())

In [147]:
df2

         C1        C2        C3
0 -0.207488  0.253575 -1.831179
1 -0.207488  1.357684 -0.992854
2  0.123655  0.387540  0.220211
3  0.838412  0.387540 -1.367592
4 -1.584530 -0.448640 -0.992854

In [148]:
df3 = df.copy()
df3

         C1        C2        C3
0       NaN  0.253575 -1.831179
1       NaN  1.357684       NaN
2  0.123655       NaN  0.220211
3  0.838412       NaN -1.367592
4 -1.584530 -0.448640       NaN

In [158]:
df3['C2'] = np.where(pd.notnull(df3['C2']) == True, df3['C2'], df3['C1'] )

In [159]:
df3

         C1        C2        C3
0       NaN  0.253575 -1.831179
1       NaN  1.357684       NaN
2  0.123655  0.123655  0.220211
3  0.838412  0.838412 -1.367592
4 -1.584530 -0.448640       NaN

## 과제 4
```
다음의 데이터 df를 활용해서 아래 지시사항의 결과를 도출해 주세요
결측값이 들어있는 행 전체를 삭제한 데이터를 만들어주세요
결측값이 들어있는 열 전체를 삭제한 데이터를 만들어주세요
C1, C2, C3 컬럼의 행 전체를 삭제한 데이터를 만들어주세요
```

In [160]:
df = pd.DataFrame(np.random.randn(5, 4),
                  columns=['C1', 'C2', 'C3', 'C4'])

df.loc[[0, 1], 'C1'] = None
df.loc[2, 'C2'] = np.nan

In [161]:
df

         C1        C2        C3        C4
0       NaN  1.313361  0.767290  1.544838
1       NaN -1.532533 -0.469830 -0.916876
2  0.356768       NaN  0.660857  0.462762
3 -0.514265 -0.398567 -0.235105 -1.102287
4  0.166015 -0.024568 -0.899408 -0.673558

In [162]:
df.dropna() #행 삭제

         C1        C2        C3        C4
3 -0.514265 -0.398567 -0.235105 -1.102287
4  0.166015 -0.024568 -0.899408 -0.673558

In [163]:
df.dropna(1) #열 삭제

/private/var/mobile/Containers/Data/Application/17E42106-9DBD-43A0-AE73-170C5EF63278/tmp/ipykernel_19579/4279380323.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.dropna will be keyword-only
  df.dropna(1)

         C3        C4
0  0.767290  1.544838
1 -0.469830 -0.916876
2  0.660857  0.462762
3 -0.235105 -1.102287
4 -0.899408 -0.673558

In [168]:
df.drop(columns=['C1', 'C2', 'C3'])

         C4
0  1.544838
1 -0.916876
2  0.462762
3 -1.102287
4 -0.673558

# 과제 5

다음의 순서를 따라 결측치 보간(interpolate) 를 수행해 주세요
아래와 같은 결과의 Series 을 만들어주세요

```
2021-01-03     1.0
2021-01-04     NaN
2021-01-07     NaN
2021-01-10    10.0

```

In [170]:
data_date = ['2021-01-03', '2021-01-04', '2021-01-07', '2021-01-10']
data_num = [1, np.nan, np.nan, 10]

In [172]:
data_date = pd.to_datetime(data_date)

```
선형으로 비례하는 결측 보간을 수행해 결측값을 채워주세요
시계열 날짜 index를 기준으로 결측값을 보간해주세요
다음의 데이터를 dataFrame 값을 기준으로 선형으로 비례하는 방식으로 결측값을 보간해주세요
```

In [173]:
data = pd.Series(data_num, index=data_date)
data

2021-01-03     1.0
2021-01-04     NaN
2021-01-07     NaN
2021-01-10    10.0
dtype: float64

In [174]:
#선형으로 비례하는 결측 보간을 수행하기기

data_linear = data.interpolate()
data_linear

2021-01-03     1.0
2021-01-04     4.0
2021-01-07     7.0
2021-01-10    10.0
dtype: float64

In [175]:
# 시계열 날짜 index 기준으로 결측값 보간하기기
data_time = data.interpolate(method='time')
data_time

2021-01-03     1.000000
2021-01-04     2.285714
2021-01-07     6.142857
2021-01-10    10.000000
dtype: float64

In [176]:
df = pd.DataFrame({'C1': [1, 2, np.nan, np.nan, 5],
                   'C2': [6, 8, 10, np.nan, 20]})

# 위의 데이터 기준으로 보기하기

In [ ]:
df

In [177]:
data_values = df.interpolate(method='values')
data_values

    C1    C2
0  1.0   6.0
1  2.0   8.0
2  3.0  10.0
3  4.0  15.0
4  5.0  20.0